app/controllers/survey_templates_controller.rb

SELECT "survey_templates".* FROM "survey_templates" WHERE "survey_templates"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "survey_responses".* FROM "survey_responses" WHERE "survey_responses"."survey_template_id" = 6
SELECT "survey_response_lines".* FROM "survey_response_lines" WHERE "survey_response_lines"."survey_response_id" = 1
---
  def export

    @survey_template = SurveyTemplate.find(params[:id])
    spreadsheet = StringIO.new ""
    book = Spreadsheet::Workbook.new
    @survey_template.survey_responses.each do |sr|
      i||=0
      i=i+1
      sheet = book.create_worksheet#(:name=>"#{i} #{sr.azienda}")
      bold = Spreadsheet::Format.new :weight => :bold

      sheet.update_row 0, @survey_template.nome
      sheet.update_row 1, "","Azienda",sr.azienda

      sheet.update_row 2, "","Nome e Cognome","#{sr.nome} #{sr.cognome}"
      sheet.update_row 3, "","Telefono","#{sr.telefono}"
      sheet.update_row 4, "","Email","#{sr.email}"
      sheet.update_row 5, "CODICE",	"DESCRIZIONE","UNITA' DI MISURA",	"DATI ANNUALI"
      linea =5
      sheet.row(linea).set_format(0, bold)
      sheet.row(linea).set_format(1, bold)
      sheet.row(linea).set_format(2, bold)
      sheet.row(linea).set_format(3, bold)
      linea =6
      gruppo =""
      sr.survey_response_lines.each do |srl|

SELECT "survey_templates".* FROM "survey_templates"
---
  def index
    @survey_templates = SurveyTemplate.all

SELECT "survey_templates".* FROM "survey_templates" WHERE "survey_templates"."id" = ? LIMIT 1  [["id", "all"]]
---
  def show
    @survey_template = SurveyTemplate.find(params[:id])

SELECT "survey_templates".* FROM "survey_templates" WHERE "survey_templates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @survey_template = SurveyTemplate.find(params[:id])

SELECT "survey_templates".* FROM "survey_templates" WHERE "survey_templates"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "survey_templates" SET "descrizione" = '', "linee_guida_file_name" = '130118_tab_per_new_release.xls', "linee_guida_content_type" = 'application/vnd.ms-excel', "linee_guida_file_size" = 57344, "linee_guida_updated_at" = '2013-02-02 15:17:33.169877', "updated_at" = '2013-02-02 15:17:33.170877' WHERE "survey_templates"."id" = 6
---
  def update
    @survey_template = SurveyTemplate.find(params[:id])
    if @survey_template.update_attributes(params[:survey_template])