app/controllers/survey_responses_controller.rb

SELECT "survey_responses".* FROM "survey_responses"
---
  def all

    @survey_responses = SurveyResponse.all

SELECT "survey_templates".* FROM "survey_templates" WHERE "survey_templates"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "survey_responses".* FROM "survey_responses" WHERE "survey_responses"."survey_template_id" = 2
---
  def index
    template=params[:survey_template_id]
    @survey_template=SurveyTemplate.find(template)
    if current_user.is_admin?
      @survey_responses = SurveyResponse.where(:survey_template_id=>@survey_template.id)

SELECT "survey_responses".* FROM "survey_responses" WHERE "survey_responses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @survey_response = SurveyResponse.find(params[:id])

SELECT "survey_templates".* FROM "survey_templates" WHERE "survey_templates"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "survey_template_lines".* FROM "survey_template_lines" WHERE "survey_template_lines"."survey_template_id" = 5
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
---
  def new
    template=params[:survey_template_id]
    @survey_template=SurveyTemplate.find(template)
    @survey_response = SurveyResponse.new(:survey_template_id => @survey_template.id, :user_id=>current_user.id, :azienda=>current_user.username)
    @survey_template.survey_template_lines.roots.each do |r|

SELECT "survey_responses".* FROM "survey_responses" WHERE "survey_responses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @survey_response = SurveyResponse.find(params[:id])

INSERT INTO "survey_responses" ("azienda", "cognome", "created_at", "data_compilazione", "email", "nome", "survey_template_id", "telefono", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @survey_response = SurveyResponse.new(params[:survey_response])

    respond_to do |format|
      if @survey_response.save

SELECT "survey_responses".* FROM "survey_responses" WHERE "survey_responses"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "survey_responses" SET "nome" = 'dasdsa', "updated_at" = '2013-02-01 23:06:27.606375' WHERE "survey_responses"."id" = 6
---
  def update
    @survey_response = SurveyResponse.find(params[:id])

    respond_to do |format|
      if @survey_response.update_attributes(params[:survey_response])