app/controllers/survey_template_lines_controller.rb

  def edit
    @survey_template_line = SurveyTemplateLine.find(params[:id])
---
SELECT "survey_template_lines".* FROM "survey_template_lines" WHERE "survey_template_lines"."id" = ? LIMIT 1  [["id", "108"]]

  def update
    @survey_template_line = SurveyTemplateLine.find(params[:id])
    if @survey_template_line.update_attributes(params[:survey_template_line])
---
SELECT "survey_template_lines".* FROM "survey_template_lines" WHERE "survey_template_lines"."id" = ? LIMIT 1  [["id", "104"]]
UPDATE "survey_template_lines" SET "progressivo" = 1, "tipo_dato" = 'testuale', "um" = 'Nr', "updated_at" = '2013-02-01 23:02:43.710568' WHERE "survey_template_lines"."id" = 104